#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```terraform

Acquiring state lock. This may take a few moments...
google_compute_network.peering_network: Refreshing state... [id=projects/gh-bot-386308/global/networks/private-network]
google_storage_bucket.gcs_bucket: Refreshing state... [id=gh-bot-tfstate]
google_compute_global_address.private_ip_address: Refreshing state... [id=projects/gh-bot-386308/global/addresses/private-ip-address]
google_service_networking_connection.default: Refreshing state... [id=projects%2Fgh-bot-386308%2Fglobal%2Fnetworks%2Fprivate-network:servicenetworking.googleapis.com]
google_sql_database_instance.instance: Refreshing state... [id=terraform-20230511121344450000000001]
google_sql_user.database-user: Refreshing state... [id=github-bot//terraform-20230511121344450000000001]
google_cloud_run_service.run: Refreshing state... [id=locations/us-central1/namespaces/gh-bot-386308/services/gh-bot]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_cloud_run_service.run will be created
  + resource "google_cloud_run_service" "run" {
      + autogenerate_revision_name = true
      + id                         = (known after apply)
      + location                   = "us-central1"
      + name                       = "gh-bot"
      + project                    = "gh-bot-386308"
      + status                     = (known after apply)

      + template {
          + metadata {
              + annotations      = {
                  + "run.googleapis.com/cloudsql-instances" = "gh-bot-386308:europe-central2:terraform-20230511121344450000000001"
                }
              + generation       = (known after apply)
              + labels           = (known after apply)
              + name             = (known after apply)
              + namespace        = (known after apply)
              + resource_version = (known after apply)
              + self_link        = (known after apply)
              + uid              = (known after apply)
            }
          + spec {
              + container_concurrency = (known after apply)
              + service_account_name  = (sensitive value)
              + serving_state         = (known after apply)
              + timeout_seconds       = (known after apply)

              + containers {
                  + args  = [
                      + "-cloud=true",
                    ]
                  + image = "s3kkt/github-releases-bot:a4a62e9"
                  + name  = (known after apply)

                  + env {
                      # At least one attribute in this block is (or was) sensitive,
                      # so its contents will not be displayed.
                    }
                  + env {
                      # At least one attribute in this block is (or was) sensitive,
                      # so its contents will not be displayed.
                    }
                  + env {
                      # At least one attribute in this block is (or was) sensitive,
                      # so its contents will not be displayed.
                    }
                  + env {
                      # At least one attribute in this block is (or was) sensitive,
                      # so its contents will not be displayed.
                    }
                  + env {
                      # At least one attribute in this block is (or was) sensitive,
                      # so its contents will not be displayed.
                    }
                  + env {
                      # At least one attribute in this block is (or was) sensitive,
                      # so its contents will not be displayed.
                    }
                  + env {
                      # At least one attribute in this block is (or was) sensitive,
                      # so its contents will not be displayed.
                    }
                  + env {
                      # At least one attribute in this block is (or was) sensitive,
                      # so its contents will not be displayed.
                    }
                  + env {
                      # At least one attribute in this block is (or was) sensitive,
                      # so its contents will not be displayed.
                    }

                  + liveness_probe {
                      + failure_threshold     = 3
                      + initial_delay_seconds = 0
                      + period_seconds        = 10
                      + timeout_seconds       = 1

                      + http_get {
                          + path = "/live"
                          + port = (known after apply)
                        }
                    }

                  + ports {
                      + container_port = 8080
                      + name           = (known after apply)
                    }
                }
            }
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @s3kkt, Action: `pull_request`*